# matplotlib
- matplotlib is the primary scientific plotting library in Python.

In [6]:
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
# generating a sequence of numbers from -10 to 10 with 100 steps in between
x = np.linspace(-10, 10, 100)
# creating a second array using sine
y = np.sin(x)
# The plot function makes a line chart of one array against another
plt.plot(x, y, marker="x")

# pandas 
- pandas is a Python library for data warngling and analysis.
- create a simple dataset of people

In [4]:
import pandas as pd
data = { "name": ["Gopal", "Bimalendu", "Subham", "Yubraj"],
        "Location": ["Baragram", "Badra", "Bispura", "Baragram"],
        "Age": [19, 20, 20, 21]
       }
data_pandas = pd.DataFrame(data)
display(data_pandas)
print("There are several possible ways to query this table. For example:\nSelecting all rows that have an age column greater than 19")
display(data_pandas[data_pandas.Age > 19])

        name  Location  Age
0      Gopal  Baragram   19
1  Bimalendu     Badra   20
2     Subham   Bispura   20
3     Yubraj  Baragram   21

There are several possible ways to query this table. For example:
Selecting all rows that have an age column greater than 19

        name  Location  Age
1  Bimalendu     Badra   20
2     Subham   Bispura   20
3     Yubraj  Baragram   21